import styles from './aboutCompany.module.css'
import { NavLink } from 'react-router-dom'
import Nav from '../../Nav/Nav'
import Footer from '../../Footer/Footer'
import img1 from '../../../assets/swiper/sw1.png'
import img2 from '../../../assets/swiper/sw2.png'
import img3 from '../../../assets/swiper/sw3.png'
import img4 from '../../../assets/swiper/sw4.png'
import img5 from '../../../assets/swiper/sw5.png'
import Header from '../../Header/Header'

const AboutCompany = () => {
    return (
        <div className={styles.wrapper}>
            <div className={styles.firstSection}>

                {/* <Header color={''}/>  FOR BLACK*/}
                {/* <Header color={'white'}/>  FOR WHITE*/}
                <Header color={'white'} />

                <div className={styles.textWrapper}>
                    <div className={styles.aboutCompany}>
                        <span>ТОВ «ВЛАСТ БУД»</span>
                        <p>
                            Будівельна компанія ТОВ «ВЛАСТ БУД»<small> входить до групи будівельних
                            компаній ВЛАСТ ГРУПА, яка охоплює весь спектр робіт у реалізації
                            проектів від створення концепції, розробки проекту до здачі об&#39;єкта в
                            експлуатацію, а також продажу площ.
                            У групі будівельних компаній </small> ТОВ «ВЛАСТ БУД» <small> успішно виконує функції
                            Керуючої компанії та Генерального підрядника.
                            Компанія успішно виконує роботи у сфері будівництва (багатоповерхові
                            житлові та громадські будівлі, котеджі) та ремонту (капітальний або
                            косметичний ремонт, демонтаж конструкцій, оздоблення квартир, кафе,
                            офісів).</small>
                        </p>
                        <hr />

                    </div>

                    <div className={styles.ourServices}>
                        <span>Наші послуги</span>
                            <div className={styles.ourServicesWrapper}>
                                <div className={styles.ourServicesElementWrapper}>
                                    <div className={styles.ourServicesElement}>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class="bi bi-building-fill-gear" viewBox="0 0 16 16">
                                            <path d="M2 1a1 1 0 0 1 1-1h10a1 1 0 0 1 1 1v7.256A4.493 4.493 0 0 0 12.5 8a4.493 4.493 0 0 0-3.59 1.787A.498.498 0 0 0 9 9.5v-1a.5.5 0 0 0-.5-.5h-1a.5.5 0 0 0-.5.5v1a.5.5 0 0 0 .5.5h1a.5.5 0 0 0 .39-.187A4.476 4.476 0 0 0 8.027 12H6.5a.5.5 0 0 0-.5.5V16H3a1 1 0 0 1-1-1V1Zm2 1.5v1a.5.5 0 0 0 .5.5h1a.5.5 0 0 0 .5-.5v-1a.5.5 0 0 0-.5-.5h-1a.5.5 0 0 0-.5.5Zm3 0v1a.5.5 0 0 0 .5.5h1a.5.5 0 0 0 .5-.5v-1a.5.5 0 0 0-.5-.5h-1a.5.5 0 0 0-.5.5Zm3.5-.5a.5.5 0 0 0-.5.5v1a.5.5 0 0 0 .5.5h1a.5.5 0 0 0 .5-.5v-1a.5.5 0 0 0-.5-.5h-1ZM4 5.5v1a.5.5 0 0 0 .5.5h1a.5.5 0 0 0 .5-.5v-1a.5.5 0 0 0-.5-.5h-1a.5.5 0 0 0-.5.5ZM7.5 5a.5.5 0 0 0-.5.5v1a.5.5 0 0 0 .5.5h1a.5.5 0 0 0 .5-.5v-1a.5.5 0 0 0-.5-.5h-1Zm2.5.5v1a.5.5 0 0 0 .5.5h1a.5.5 0 0 0 .5-.5v-1a.5.5 0 0 0-.5-.5h-1a.5.5 0 0 0-.5.5ZM4.5 8a.5.5 0 0 0-.5.5v1a.5.5 0 0 0 .5.5h1a.5.5 0 0 0 .5-.5v-1a.5.5 0 0 0-.5-.5h-1Z"/>
                                            <path d="M11.886 9.46c.18-.613 1.048-.613 1.229 0l.043.148a.64.64 0 0 0 .921.382l.136-.074c.561-.306 1.175.308.87.869l-.075.136a.64.64 0 0 0 .382.92l.149.045c.612.18.612 1.048 0 1.229l-.15.043a.64.64 0 0 0-.38.921l.074.136c.305.561-.309 1.175-.87.87l-.136-.075a.64.64 0 0 0-.92.382l-.045.149c-.18.612-1.048.612-1.229 0l-.043-.15a.64.64 0 0 0-.921-.38l-.136.074c-.561.305-1.175-.309-.87-.87l.075-.136a.64.64 0 0 0-.382-.92l-.148-.045c-.613-.18-.613-1.048 0-1.229l.148-.043a.64.64 0 0 0 .382-.921l-.074-.136c-.306-.561.308-1.175.869-.87l.136.075a.64.64 0 0 0 .92-.382l.045-.148ZM14 12.5a1.5 1.5 0 1 0-3 0 1.5 1.5 0 0 0 3 0Z"/>
                                        </svg>
                                        <span>Будівництво житлових і нежитлових будівель</span>
                                    </div>
                                    <div className={styles.ourServicesElement}>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class="bi bi-buildings-fill" viewBox="0 0 16 16">
                                            <path d="M15 .5a.5.5 0 0 0-.724-.447l-8 4A.5.5 0 0 0 6 4.5v3.14L.342 9.526A.5.5 0 0 0 0 10v5.5a.5.5 0 0 0 .5.5h9a.5.5 0 0 0 .5-.5V14h1v1.5a.5.5 0 0 0 .5.5h3a.5.5 0 0 0 .5-.5V.5ZM2 11h1v1H2v-1Zm2 0h1v1H4v-1Zm-1 2v1H2v-1h1Zm1 0h1v1H4v-1Zm9-10v1h-1V3h1ZM8 5h1v1H8V5Zm1 2v1H8V7h1ZM8 9h1v1H8V9Zm2 0h1v1h-1V9Zm-1 2v1H8v-1h1Zm1 0h1v1h-1v-1Zm3-2v1h-1V9h1Zm-1 2h1v1h-1v-1Zm-2-4h1v1h-1V7Zm3 0v1h-1V7h1Zm-2-2v1h-1V5h1Zm1 0h1v1h-1V5Z"/>
                                        </svg>
                                        <span>Будівництво різного типу споруд</span>
                                    </div>
                                </div>
                                <div className={styles.ourServicesElementWrapper}>
                                    <div className={styles.ourServicesElement}>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class="bi bi-arrow-repeat" viewBox="0 0 16 16">
                                            <path d="M11.534 7h3.932a.25.25 0 0 1 .192.41l-1.966 2.36a.25.25 0 0 1-.384 0l-1.966-2.36a.25.25 0 0 1 .192-.41zm-11 2h3.932a.25.25 0 0 0 .192-.41L2.692 6.23a.25.25 0 0 0-.384 0L.342 8.59A.25.25 0 0 0 .534 9z"/>
                                            <path fill-rule="evenodd" d="M8 3c-1.552 0-2.94.707-3.857 1.818a.5.5 0 1 1-.771-.636A6.002 6.002 0 0 1 13.917 7H12.9A5.002 5.002 0 0 0 8 3zM3.1 9a5.002 5.002 0 0 0 8.757 2.182.5.5 0 1 1 .771.636A6.002 6.002 0 0 1 2.083 9H3.1z"/>
                                        </svg>
                                        <span>Знесення та підготовчі роботи на будівельному майданчику</span>
                                    </div>
                                    <div className={styles.ourServicesElement}>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class="bi bi-gear-fill" viewBox="0 0 16 16">
                                            <path d="M9.405 1.05c-.413-1.4-2.397-1.4-2.81 0l-.1.34a1.464 1.464 0 0 1-2.105.872l-.31-.17c-1.283-.698-2.686.705-1.987 1.987l.169.311c.446.82.023 1.841-.872 2.105l-.34.1c-1.4.413-1.4 2.397 0 2.81l.34.1a1.464 1.464 0 0 1 .872 2.105l-.17.31c-.698 1.283.705 2.686 1.987 1.987l.311-.169a1.464 1.464 0 0 1 2.105.872l.1.34c.413 1.4 2.397 1.4 2.81 0l.1-.34a1.464 1.464 0 0 1 2.105-.872l.31.17c1.283.698 2.686-.705 1.987-1.987l-.169-.311a1.464 1.464 0 0 1 .872-2.105l.34-.1c1.4-.413 1.4-2.397 0-2.81l-.34-.1a1.464 1.464 0 0 1-.872-2.105l.17-.31c.698-1.283-.705-2.686-1.987-1.987l-.311.169a1.464 1.464 0 0 1-2.105-.872l-.1-.34zM8 10.93a2.929 2.929 0 1 1 0-5.86 2.929 2.929 0 0 1 0 5.858z"/>
                                        </svg>
                                        <span>Електромонтажні, водопровідні та інші будівельно-монтажні роботи</span>
                                    </div>
                                </div>
                                <div className={styles.ourServicesElement}>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class="bi bi-calendar-check-fill" viewBox="0 0 16 16">
                                        <path d="M4 .5a.5.5 0 0 0-1 0V1H2a2 2 0 0 0-2 2v1h16V3a2 2 0 0 0-2-2h-1V.5a.5.5 0 0 0-1 0V1H4V.5zM16 14V5H0v9a2 2 0 0 0 2 2h12a2 2 0 0 0 2-2zm-5.146-5.146-3 3a.5.5 0 0 1-.708 0l-1.5-1.5a.5.5 0 0 1 .708-.708L7.5 10.793l2.646-2.647a.5.5 0 0 1 .708.708z"/>
                                    </svg>
                                    <span>Роботи із завершення будівництва</span>
                                </div>
                            </div>

                        <hr />
                    </div>
                        
                    {/* <div className={styles.ourPartners}>
                        <span>Партнери компанії</span>

                        <div className={styles.partnersBlock}>
                            <div className={styles.partnersBlockItem}>

                            </div>
                            <div className={styles.partnersBlockItem}></div>
                            <div className={styles.partnersBlockItem}></div>
                            <div className={styles.partnersBlockItem}></div>
                            <div className={styles.partnersBlockItem}></div>
                            <div className={styles.partnersBlockItem}></div>
                        </div>

                        <hr />
                    </div> */}


                    <div className={styles.ourOptions}>
                        <span>Нашi можливостi</span>

                        <div className={styles.optionList}>
                            <div className={styles.optionCardBigL}>
                                {/* <img src={img5} /> */}
                                <p>
                                    <span>Будівництво</span><br />
                                    Функції Керуючої компанії:<br />
                                    - проведення тендерів та укладення договорів із генеральною<br /> проектною
                                    організацією;<br />
                                    - визначення основної стратегії будівництва (генеральний графік<br />
                                    будівництва та фінансування);<br />
                                    - визначення черговості будівництва та пускових комплексів;<br />
                                    - проведення тендерів та укладення договорів з іншими суб&#39;єктами<br />
                                    будівництва (виконання функцій Замовника та Генерального
                                    підрядника).<br /><br />

                                    Виконання функцій Замовника:<br />
                                    - аналіз проектно-кошторисної документації;<br />
                                    - технічний контроль і нагляд за ходом будівництва;<br />
                                    - прийняття закінчених обсягів робіт і здача об&#39;єкта в експлуатацію;<br />
                                    - передача технічної та виконавчої документації експлуатуючій
                                    організації.<br /><br />

                                    Виконання функцій Генерального підрядника:<br />
                                    - підготовка будівельного виробництва;<br />
                                    - координація робіт субпідрядних організацій;<br />
                                    - матеріально-технічне забезпечення будівельних робіт;<br />
                                    - забезпечення заходів з охорони праці та техніки безпеки;<br />
                                    - передача Замовнику закінченого об&#39;єкта будівництва, згідно з актом
                                    робочої комісії з усією робочою документацією;<br />
                                    - видача гарантійного паспорта на об&#39;єкт.<br />
                                </p>
                            </div>

                            <div className={styles.optionCardR}>
                                <p>
                                    <span>Землевідведення</span><br />
                                    - Розробка проєкту відведення земельної ділянки<br />
                                    - Оформлення права власності або оренди земельної ділянки<br />
                                </p>
                                <img src={img2} />
                            </div>

                            <div className={styles.optionCard}>
                                <img src={img3} />
                                <p>
                                    <span>Розроблення концепцій</span><br />Розроблення концепції майбутнього проєкту
                                    Роботи, що виконуються до початку проектування:

                                    - коефіцієнт забудови ділянки;<br />
                                    - розробка принципових об&#39;ємно-просторових, планувальних,
                                    містобудівних рішень;<br />
                                    - визначення інженерної характеристики проекту;<br />
                                    - складання завдань на інженерні вишукування;<br />
                                    - складання завдання на проектування;<br />
                                    - інші види робіт, необхідних для початку процесу;<br />
                                    - проектування (обстеження існуючих будівель, визначення необхідного<br />
                                    знесення існуючих будівель, зелених насаджень та ін.).
                                </p>
                            </div>

                            <div className={styles.optionCardBigR}>
                                <p>
                                    <span>Супровід проектування</span><br />
                                    Збір і підготовка вихідних даних:
                                    - АПЗ;<br />
                                    - технічні умови;<br />
                                    - геологічні дослідження;<br />
                                    - історичні вишукування;<br />
                                    - складання тех. завдання на проектування.<br /><br />
                                    Стадія «П» (Проект)
                                    Розділи проекту:<br />
                                    - пояснювальна записка:<br />
                                    - 1. загальні положення;<br />
                                    - 2. архітектурно-будівельні рішення;<br />
                                    - 3. технологічна частина;<br />
                                    - 4. рішення щодо технологічного обладнання;<br />

                                    - графічна частина;<br />
                                    - розділ організації будівництва;<br />
                                    - кошторисна документація;<br />
                                    - вплив на навколишнє середовище.<br />

                                    Проходження державної експертизи, затвердження, реєстрація та погодження
                                    в установленому порядку
                                    Отримання дозволу на будівництво<br /><br />

                                    Стадія «Р» (розробка робочої документації)<br />

                                    - робочі креслення (розробляються відповідно до вимог нормативних
                                    документів);<br />
                                    - паспорт оздоблювальних робіт;<br />
                                    - кошторисна документація;<br />
                                    - специфікація обладнання та матеріалів (включно з опитувальними
                                    листами та габаритними кресленнями на відповідними видами
                                    обладнання та виробів);<br />
                                    - затвердження проектної документації в Інвестора.<br />
                                </p>
                                <img src={img4} />
                            </div>

                            <div className={styles.optionCard}>
                                <img src={img1} />
                                <p>
                                    <span>Маркетинг</span><br />
                                    - Прогнозування інвестиційних очікувань<br />
                                    - Вивчення конкурентного середовища<br />
                                    - Статистичні дані<br />
                                    - Прогнозування ступеня затребуваності проекту потенційними споживачами<br />
                                    - Альтернативні концепції<br />
                                    - Оцінювання ризику інвестиційного проєкту<br />
                                </p>
                            </div>

                        </div>
                    </div>

                </div>
                <div className={styles.footer}><Footer /></div>

            </div>

        </div>
    )
}
export default AboutCompany