import styles from './realizedProjects.module.css'
import { NavLink } from 'react-router-dom'
import Nav from '../../Nav/Nav'
import Footer from '../../Footer/Footer'
import img1 from '../../../assets/swiper/sw1.png'
import img2 from '../../../assets/swiper/sw2.png'
import img3 from '../../../assets/swiper/sw3.png'
import img4 from '../../../assets/swiper/sw4.png'
import img5 from '../../../assets/swiper/sw5.png'

const AboutCompany = () => {
    return (
        <div className={styles.wrapper}>
            <div className={styles.firstSection}>
                <header className={styles.header}>

                    
                        <NavLink to='/'>
                        <div className={styles.logo}>
                            <span>ВЛАСТ</span>
                            <span>БУД</span>
                            </div>
                        </NavLink>
                       
                    
                    
                    <div className={styles.navigation}>
                        <Nav />
                    </div>
                </header>

                <div className={styles.textWrapper}>
                    

                    <div className={styles.ourOptions}>
                        <span>Реалізовані проекти</span>

                        <div className={styles.optionList}> 
                        {/* optionList ЗАБЛЮРЕНО */}
                            <div  className={styles.optionCard}>
                                <img src={img1} />
                                <p>
                                    <span>Будинок 1</span><br/>
                                    - Прогнозування інвестиційних очікувань<br/>
                                    - Вивчення конкурентного середовища<br/>
                                    - Статистичні дані<br/>
                                    - Прогнозування ступеня затребуваності проекту потенційними споживачами<br/>
                                    - Альтернативні концепції<br/>
                                    - Оцінювання ризику інвестиційного проєкту<br/>
                                </p>
                            </div>

                            <div className={styles.optionCardR}>
                                <p>
                                    <span>Будинок 2</span><br/>
                                    - Розробка проєкту відведення земельної ділянки<br/>
                                    - Оформлення права власності або оренди земельної ділянки<br/>
                                </p>
                                <img src={img2} />
                            </div>

                            <div className={styles.optionCard}>
                            <img src={img3} />
                                <p>
                                    <span>Будинок 3</span><br/>Розроблення концепції майбутнього проєкту
                                    Роботи, що виконуються до початку проектування:

                                    - коефіцієнт забудови ділянки;<br/>
                                    - розробка принципових об&#39;ємно-просторових, планувальних,
                                    містобудівних рішень;<br/>
                                    - визначення інженерної характеристики проекту;<br/>
                                    - складання завдань на інженерні вишукування;<br/>
                                    - складання завдання на проектування;<br/>
                                    - інші види робіт, необхідних для початку процесу;<br/>
                                    - проектування (обстеження існуючих будівель, визначення необхідного<br/>
                                    знесення існуючих будівель, зелених насаджень та ін.).
                                </p>
                            </div>

                        </div>


                        <span>Будуємо</span>

                        <div className={styles.optionList}>
                            {/* optionList ЗАБЛЮРЕНО */}
                            <div  className={styles.optionCard}>
                                <img src={img1} />
                                <p>
                                    <span>Будинок 1</span><br/>
                                    - Прогнозування інвестиційних очікувань<br/>
                                    - Вивчення конкурентного середовища<br/>
                                    - Статистичні дані<br/>
                                    - Прогнозування ступеня затребуваності проекту потенційними споживачами<br/>
                                    - Альтернативні концепції<br/>
                                    - Оцінювання ризику інвестиційного проєкту<br/>
                                </p>
                            </div>

                            <div className={styles.optionCardR}>
                                <p>
                                    <span>Будинок 2</span><br/>
                                    - Розробка проєкту відведення земельної ділянки<br/>
                                    - Оформлення права власності або оренди земельної ділянки<br/>
                                </p>
                                <img src={img2} />
                            </div>

                            <div className={styles.optionCard}>
                            <img src={img3} />
                                <p>
                                    <span>Будинок 3</span><br/>Розроблення концепції майбутнього проєкту
                                    Роботи, що виконуються до початку проектування:

                                    - коефіцієнт забудови ділянки;<br/>
                                    - розробка принципових об&#39;ємно-просторових, планувальних,
                                    містобудівних рішень;<br/>
                                    - визначення інженерної характеристики проекту;<br/>
                                    - складання завдань на інженерні вишукування;<br/>
                                    - складання завдання на проектування;<br/>
                                    - інші види робіт, необхідних для початку процесу;<br/>
                                    - проектування (обстеження існуючих будівель, визначення необхідного<br/>
                                    знесення існуючих будівель, зелених насаджень та ін.).
                                </p>
                            </div>

                        </div>


                        <span>Реконструюємо</span>

                        <div className={styles.optionList}>
                            {/* optionList ЗАБЛЮРЕНО */}
                            <div  className={styles.optionCard}>
                                <img src={img1} />
                                <p>
                                    <span>Будинок 1</span><br/>
                                    - Прогнозування інвестиційних очікувань<br/>
                                    - Вивчення конкурентного середовища<br/>
                                    - Статистичні дані<br/>
                                    - Прогнозування ступеня затребуваності проекту потенційними споживачами<br/>
                                    - Альтернативні концепції<br/>
                                    - Оцінювання ризику інвестиційного проєкту<br/>
                                </p>
                            </div>

                            <div className={styles.optionCardR}>
                                <p>
                                    <span>Будинок 2</span><br/>
                                    - Розробка проєкту відведення земельної ділянки<br/>
                                    - Оформлення права власності або оренди земельної ділянки<br/>
                                </p>
                                <img src={img2} />
                            </div>

                            <div className={styles.optionCard}>
                            <img src={img3} />
                                <p>
                                    <span>Будинок 3</span><br/>Розроблення концепції майбутнього проєкту
                                    Роботи, що виконуються до початку проектування:

                                    - коефіцієнт забудови ділянки;<br/>
                                    - розробка принципових об&#39;ємно-просторових, планувальних,
                                    містобудівних рішень;<br/>
                                    - визначення інженерної характеристики проекту;<br/>
                                    - складання завдань на інженерні вишукування;<br/>
                                    - складання завдання на проектування;<br/>
                                    - інші види робіт, необхідних для початку процесу;<br/>
                                    - проектування (обстеження існуючих будівель, визначення необхідного<br/>
                                    знесення існуючих будівель, зелених насаджень та ін.).
                                </p>
                            </div>

                        </div>
                    </div>
                    
                </div>
                <div className={styles.footer}><Footer/></div>
                
            </div>
            
        </div>
    )
}
export default AboutCompany